; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-4-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-5 - location
	p0-6 - location
	p0-7 - location
	p1-0 - location
	p1-5 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p2-6 - location
	p3-5 - location
	p3-7 - location
	p5-2 - location
	p5-7 - location
	p7-1 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s7)
	(at driver3 s3)
	(at driver4 s0)
	(at driver5 s2)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s7)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s7)
	(empty truck4)
	(at package1 s0)
	(at package2 s1)
	(at package3 s5)
	(at package4 s0)
	(at package5 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 25)
	(= (time-to-walk p0-5 s0) 25)
	(= (time-to-walk s5 p0-5) 3)
	(= (time-to-walk p0-5 s5) 3)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 43)
	(= (time-to-walk p0-6 s0) 43)
	(= (time-to-walk s6 p0-6) 47)
	(= (time-to-walk p0-6 s6) 47)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(= (time-to-walk s0 p0-7) 9)
	(= (time-to-walk p0-7 s0) 9)
	(= (time-to-walk s7 p0-7) 76)
	(= (time-to-walk p0-7 s7) 76)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 95)
	(= (time-to-walk p1-0 s1) 95)
	(= (time-to-walk s0 p1-0) 97)
	(= (time-to-walk p1-0 s0) 97)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 77)
	(= (time-to-walk p1-5 s1) 77)
	(= (time-to-walk s5 p1-5) 36)
	(= (time-to-walk p1-5 s5) 36)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 68)
	(= (time-to-walk p2-0 s2) 68)
	(= (time-to-walk s0 p2-0) 6)
	(= (time-to-walk p2-0 s0) 6)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 100)
	(= (time-to-walk p2-3 s2) 100)
	(= (time-to-walk s3 p2-3) 66)
	(= (time-to-walk p2-3 s3) 66)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 97)
	(= (time-to-walk p2-4 s2) 97)
	(= (time-to-walk s4 p2-4) 93)
	(= (time-to-walk p2-4 s4) 93)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 72)
	(= (time-to-walk p2-6 s2) 72)
	(= (time-to-walk s6 p2-6) 76)
	(= (time-to-walk p2-6 s6) 76)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 60)
	(= (time-to-walk p3-5 s3) 60)
	(= (time-to-walk s5 p3-5) 91)
	(= (time-to-walk p3-5 s5) 91)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(= (time-to-walk s3 p3-7) 98)
	(= (time-to-walk p3-7 s3) 98)
	(= (time-to-walk s7 p3-7) 53)
	(= (time-to-walk p3-7 s7) 53)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 61)
	(= (time-to-walk p5-2 s5) 61)
	(= (time-to-walk s2 p5-2) 17)
	(= (time-to-walk p5-2 s2) 17)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(= (time-to-walk s5 p5-7) 78)
	(= (time-to-walk p5-7 s5) 78)
	(= (time-to-walk s7 p5-7) 70)
	(= (time-to-walk p5-7 s7) 70)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(= (time-to-walk s7 p7-1) 83)
	(= (time-to-walk p7-1 s7) 83)
	(= (time-to-walk s1 p7-1) 10)
	(= (time-to-walk p7-1 s1) 10)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 29)
	(= (time-to-drive s2 s0) 29)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 61)
	(= (time-to-drive s3 s0) 61)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 39)
	(= (time-to-drive s4 s0) 39)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 53)
	(= (time-to-drive s7 s0) 53)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 64)
	(= (time-to-drive s0 s1) 64)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 81)
	(= (time-to-drive s2 s1) 81)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 100)
	(= (time-to-drive s4 s1) 100)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 72)
	(= (time-to-drive s6 s1) 72)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 56)
	(= (time-to-drive s2 s3) 56)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 94)
	(= (time-to-drive s2 s4) 94)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 69)
	(= (time-to-drive s0 s5) 69)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 33)
	(= (time-to-drive s3 s5) 33)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 29)
	(= (time-to-drive s2 s6) 29)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 36)
	(= (time-to-drive s4 s6) 36)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 38)
	(= (time-to-drive s2 s7) 38)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 29)
	(= (time-to-drive s5 s7) 29)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s0)
	(at driver4 s7)
	(at truck1 s2)
	(at truck2 s0)
	(at truck3 s2)
	(at truck4 s7)
	(at package1 s6)
	(at package2 s1)
	(at package3 s1)
	(at package4 s5)
	(at package5 s6)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 2  (driven))) (* 1  (walked))))

)

; plan
1. (board-truck driver4 truck1 s0)
   deleted: (at driver4 s0) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 2 of 13
2. (walk driver1 s3 p3-5)
   deleted: (at driver1 s3)
   added: (at driver1 p3-5)
   changed: (walked) from 0 to 60
   goals met: 2 of 13
3. (walk driver1 p3-5 s5)
   deleted: (at driver1 p3-5)
   added: (at driver1 s5)
   changed: (walked) from 60 to 151
   goals met: 2 of 13
4. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   goals met: 2 of 13
5. (load-truck package4 truck1 s0)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   goals met: 2 of 13
6. (drive-truck truck1 s0 s2 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 0 to 29
   goals met: 3 of 13
7. (board-truck driver2 truck2 s7)
   deleted: (at driver2 s7) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 3 of 13
8. (drive-truck truck2 s7 s0 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s0)
   changed: (driven) from 29 to 82
   goals met: 4 of 13
9. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (driven) from 82 to 143
   goals met: 3 of 13
10. (drive-truck truck1 s2 s7 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s7)
   changed: (driven) from 143 to 181
   goals met: 2 of 13
11. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 2 of 13
12. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   changed: (walked) from 151 to 217
   goals met: 2 of 13
13. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   changed: (walked) from 217 to 317
   goals met: 3 of 13
14. (drive-truck truck1 s7 s2 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   changed: (driven) from 181 to 219
   goals met: 4 of 13
15. (board-truck driver3 truck2 s3)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 4 of 13
16. (drive-truck truck2 s3 s5 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (driven) from 219 to 252
   goals met: 4 of 13
17. (load-truck package3 truck2 s5)
   deleted: (at package3 s5)
   added: (in package3 truck2)
   goals met: 4 of 13
18. (drive-truck truck1 s2 s4 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (driven) from 252 to 346
   goals met: 3 of 13
19. (drive-truck truck2 s5 s0 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (driven) from 346 to 415
   goals met: 4 of 13
20. (load-truck package5 truck1 s4)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   goals met: 4 of 13
21. (drive-truck truck1 s4 s2 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (driven) from 415 to 509
   goals met: 5 of 13
22. (drive-truck truck1 s2 s7 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s7)
   changed: (driven) from 509 to 547
   goals met: 4 of 13
23. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 547 to 611
   goals met: 3 of 13
24. (unload-truck package3 truck2 s1)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   goals met: 4 of 13
25. (board-truck driver1 truck3 s5)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 13
26. (drive-truck truck3 s5 s3 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (driven) from 611 to 644
   goals met: 4 of 13
27. (drive-truck truck3 s3 s2 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 644 to 700
   goals met: 5 of 13
28. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 6 of 13
29. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 700 to 764
   goals met: 7 of 13
30. (drive-truck truck1 s7 s2 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   changed: (driven) from 764 to 802
   goals met: 8 of 13
31. (unload-truck package4 truck1 s2)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 8 of 13
32. (drive-truck truck1 s2 s6 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (driven) from 802 to 831
   goals met: 7 of 13
33. (unload-truck package1 truck1 s6)
   deleted: (in package1 truck1)
   added: (at package1 s6)
   goals met: 8 of 13
34. (unload-truck package5 truck1 s6)
   deleted: (in package5 truck1)
   added: (at package5 s6)
   goals met: 9 of 13
35. (drive-truck truck1 s6 s2 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (driven) from 831 to 860
   goals met: 10 of 13
36. (drive-truck truck2 s0 s5 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   changed: (driven) from 860 to 929
   goals met: 9 of 13
37. (load-truck package4 truck1 s2)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   goals met: 9 of 13
38. (drive-truck truck1 s2 s7 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s7)
   changed: (driven) from 929 to 967
   goals met: 8 of 13
39. (drive-truck truck2 s5 s0 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (driven) from 967 to 1036
   goals met: 9 of 13
40. (drive-truck truck1 s7 s5 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   changed: (driven) from 1036 to 1065
   goals met: 9 of 13
41. (unload-truck package4 truck1 s5)
   deleted: (in package4 truck1)
   added: (at package4 s5)
   goals met: 10 of 13
42. (drive-truck truck1 s5 s3 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 1065 to 1098
   goals met: 10 of 13
43. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 11 of 13
44. (disembark-truck driver4 truck1 s3)
   deleted: (driving driver4 truck1)
   added: (at driver4 s3) (empty truck1)
   goals met: 11 of 13
45. (walk driver4 s3 p3-7)
   deleted: (at driver4 s3)
   added: (at driver4 p3-7)
   changed: (walked) from 317 to 415
   goals met: 11 of 13
46. (walk driver4 p3-7 s7)
   deleted: (at driver4 p3-7)
   added: (at driver4 s7)
   changed: (walked) from 415 to 468
   goals met: 12 of 13
47. (walk driver5 s2 p2-3)
   deleted: (at driver5 s2)
   added: (at driver5 p2-3)
   changed: (walked) from 468 to 568
   goals met: 12 of 13
48. (walk driver5 p2-3 s3)
   deleted: (at driver5 p2-3)
   added: (at driver5 s3)
   changed: (walked) from 568 to 634
   goals met: 12 of 13
49. (board-truck driver5 truck1 s3)
   deleted: (at driver5 s3) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 12 of 13
50. (drive-truck truck1 s3 s2 driver5)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (driven) from 1098 to 1154
   goals met: 13 of 13
